IlleniumDillon/MM32F5277/MM32/MM32_FLEXCAN2Regdef.h
// Message Buffer 0 ID Register..Message Buffer 15 ID Register
typedef struct
{
	Strict_32Bit EXT			:18;
	Strict_32Bit STD			:11;
	Strict_32Bit PRIO			:3;
}MM32_FLEXCAN2_ID0Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_ID0Bits B;
}MM32_FLEXCAN2_ID0;

// Message Buffer 0 WORD0 Register..Message Buffer 15 WORD0 Register
typedef struct
{
	Strict_32Bit BYTE3			:8;
	Strict_32Bit BYTE2			:8;
	Strict_32Bit BYTE1			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE0			:8;
}MM32_FLEXCAN2_WORD0Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_WORD0Bits B;
}MM32_FLEXCAN2_WORD0;

// Message Buffer 0 WORD1 Register..Message Buffer 15 WORD1 Register
typedef struct
{
	Strict_32Bit BYTE7			:8;
	Strict_32Bit BYTE6			:8;
	Strict_32Bit BYTE5			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE4			:8;
}MM32_FLEXCAN2_WORD1Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_WORD1Bits B;
}MM32_FLEXCAN2_WORD1;

// Message Buffer 0 CS Register..Message Buffer 15 CS Register
typedef struct
{
	Strict_32Bit TIMESTAMP			:16;
	Strict_32Bit DLC			:4;
	Strict_32Bit RTR			:1;
	Strict_32Bit IDE			:1;
	Strict_32Bit SRR			:1;
	Strict_32Bit _reserved_0			:1;
	Strict_32Bit CODE			:4;
	Strict_32Bit _reserved_1			:4;
}MM32_FLEXCAN2_CS1Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_CS1Bits B;
}MM32_FLEXCAN2_CS1;

// Message Buffer 0 ID Register..Message Buffer 15 ID Register
typedef struct
{
	Strict_32Bit EXT			:18;
	Strict_32Bit STD			:11;
	Strict_32Bit PRIO			:3;
}MM32_FLEXCAN2_ID1Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_ID1Bits B;
}MM32_FLEXCAN2_ID1;

// Message Buffer 0 WORD0 Register..Message Buffer 15 WORD0 Register
typedef struct
{
	Strict_32Bit BYTE3			:8;
	Strict_32Bit BYTE2			:8;
	Strict_32Bit BYTE1			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE0			:8;
}MM32_FLEXCAN2_WORD01Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_WORD01Bits B;
}MM32_FLEXCAN2_WORD01;

// Message Buffer 0 WORD1 Register..Message Buffer 15 WORD1 Register
typedef struct
{
	Strict_32Bit BYTE7			:8;
	Strict_32Bit BYTE6			:8;
	Strict_32Bit BYTE5			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE4			:8;
}MM32_FLEXCAN2_WORD11Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_WORD11Bits B;
}MM32_FLEXCAN2_WORD11;

// Message Buffer 0 CS Register..Message Buffer 15 CS Register
typedef struct
{
	Strict_32Bit TIMESTAMP			:16;
	Strict_32Bit DLC			:4;
	Strict_32Bit RTR			:1;
	Strict_32Bit IDE			:1;
	Strict_32Bit SRR			:1;
	Strict_32Bit _reserved_0			:1;
	Strict_32Bit CODE			:4;
	Strict_32Bit _reserved_1			:4;
}MM32_FLEXCAN2_CS2Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_CS2Bits B;
}MM32_FLEXCAN2_CS2;

// Message Buffer 0 ID Register..Message Buffer 15 ID Register
typedef struct
{
	Strict_32Bit EXT			:18;
	Strict_32Bit STD			:11;
	Strict_32Bit PRIO			:3;
}MM32_FLEXCAN2_ID2Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_ID2Bits B;
}MM32_FLEXCAN2_ID2;

// Message Buffer 0 WORD0 Register..Message Buffer 15 WORD0 Register
typedef struct
{
	Strict_32Bit BYTE3			:8;
	Strict_32Bit BYTE2			:8;
	Strict_32Bit BYTE1			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE0			:8;
}MM32_FLEXCAN2_WORD02Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_WORD02Bits B;
}MM32_FLEXCAN2_WORD02;

// Message Buffer 0 WORD1 Register..Message Buffer 15 WORD1 Register
typedef struct
{
	Strict_32Bit BYTE7			:8;
	Strict_32Bit BYTE6			:8;
	Strict_32Bit BYTE5			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE4			:8;
}MM32_FLEXCAN2_WORD12Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_WORD12Bits B;
}MM32_FLEXCAN2_WORD12;

// Message Buffer 0 CS Register..Message Buffer 15 CS Register
typedef struct
{
	Strict_32Bit TIMESTAMP			:16;
	Strict_32Bit DLC			:4;
	Strict_32Bit RTR			:1;
	Strict_32Bit IDE			:1;
	Strict_32Bit SRR			:1;
	Strict_32Bit _reserved_0			:1;
	Strict_32Bit CODE			:4;
	Strict_32Bit _reserved_1			:4;
}MM32_FLEXCAN2_CS3Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_CS3Bits B;
}MM32_FLEXCAN2_CS3;

// Message Buffer 0 ID Register..Message Buffer 15 ID Register
typedef struct
{
	Strict_32Bit EXT			:18;
	Strict_32Bit STD			:11;
	Strict_32Bit PRIO			:3;
}MM32_FLEXCAN2_ID3Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_ID3Bits B;
}MM32_FLEXCAN2_ID3;

// Message Buffer 0 WORD0 Register..Message Buffer 15 WORD0 Register
typedef struct
{
	Strict_32Bit BYTE3			:8;
	Strict_32Bit BYTE2			:8;
	Strict_32Bit BYTE1			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE0			:8;
}MM32_FLEXCAN2_WORD03Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_WORD03Bits B;
}MM32_FLEXCAN2_WORD03;

// Message Buffer 0 WORD1 Register..Message Buffer 15 WORD1 Register
typedef struct
{
	Strict_32Bit BYTE7			:8;
	Strict_32Bit BYTE6			:8;
	Strict_32Bit BYTE5			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE4			:8;
}MM32_FLEXCAN2_WORD13Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_WORD13Bits B;
}MM32_FLEXCAN2_WORD13;

// Message Buffer 0 CS Register..Message Buffer 15 CS Register
typedef struct
{
	Strict_32Bit TIMESTAMP			:16;
	Strict_32Bit DLC			:4;
	Strict_32Bit RTR			:1;
	Strict_32Bit IDE			:1;
	Strict_32Bit SRR			:1;
	Strict_32Bit _reserved_0			:1;
	Strict_32Bit CODE			:4;
	Strict_32Bit _reserved_1			:4;
}MM32_FLEXCAN2_CS4Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_CS4Bits B;
}MM32_FLEXCAN2_CS4;

// Message Buffer 0 ID Register..Message Buffer 15 ID Register
typedef struct
{
	Strict_32Bit EXT			:18;
	Strict_32Bit STD			:11;
	Strict_32Bit PRIO			:3;
}MM32_FLEXCAN2_ID4Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_ID4Bits B;
}MM32_FLEXCAN2_ID4;

// Message Buffer 0 WORD0 Register..Message Buffer 15 WORD0 Register
typedef struct
{
	Strict_32Bit BYTE3			:8;
	Strict_32Bit BYTE2			:8;
	Strict_32Bit BYTE1			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE0			:8;
}MM32_FLEXCAN2_WORD04Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_WORD04Bits B;
}MM32_FLEXCAN2_WORD04;

