IlleniumDillon/MM32F5277/MM32/MM32_FLEXCAN2Regdef.h
// Message Buffer 0 WORD1 Register..Message Buffer 15 WORD1 Register
typedef struct
{
	Strict_32Bit BYTE7			:8;
	Strict_32Bit BYTE6			:8;
	Strict_32Bit BYTE5			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE4			:8;
}MM32_FLEXCAN2_WORD14Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_WORD14Bits B;
}MM32_FLEXCAN2_WORD14;

// Message Buffer 0 CS Register..Message Buffer 15 CS Register
typedef struct
{
	Strict_32Bit TIMESTAMP			:16;
	Strict_32Bit DLC			:4;
	Strict_32Bit RTR			:1;
	Strict_32Bit IDE			:1;
	Strict_32Bit SRR			:1;
	Strict_32Bit _reserved_0			:1;
	Strict_32Bit CODE			:4;
	Strict_32Bit _reserved_1			:4;
}MM32_FLEXCAN2_CS5Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_CS5Bits B;
}MM32_FLEXCAN2_CS5;

// Message Buffer 0 ID Register..Message Buffer 15 ID Register
typedef struct
{
	Strict_32Bit EXT			:18;
	Strict_32Bit STD			:11;
	Strict_32Bit PRIO			:3;
}MM32_FLEXCAN2_ID5Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_ID5Bits B;
}MM32_FLEXCAN2_ID5;

// Message Buffer 0 WORD0 Register..Message Buffer 15 WORD0 Register
typedef struct
{
	Strict_32Bit BYTE3			:8;
	Strict_32Bit BYTE2			:8;
	Strict_32Bit BYTE1			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE0			:8;
}MM32_FLEXCAN2_WORD05Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_WORD05Bits B;
}MM32_FLEXCAN2_WORD05;

// Message Buffer 0 WORD1 Register..Message Buffer 15 WORD1 Register
typedef struct
{
	Strict_32Bit BYTE7			:8;
	Strict_32Bit BYTE6			:8;
	Strict_32Bit BYTE5			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE4			:8;
}MM32_FLEXCAN2_WORD15Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_WORD15Bits B;
}MM32_FLEXCAN2_WORD15;

// Message Buffer 0 CS Register..Message Buffer 15 CS Register
typedef struct
{
	Strict_32Bit TIMESTAMP			:16;
	Strict_32Bit DLC			:4;
	Strict_32Bit RTR			:1;
	Strict_32Bit IDE			:1;
	Strict_32Bit SRR			:1;
	Strict_32Bit _reserved_0			:1;
	Strict_32Bit CODE			:4;
	Strict_32Bit _reserved_1			:4;
}MM32_FLEXCAN2_CS6Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_CS6Bits B;
}MM32_FLEXCAN2_CS6;

// Message Buffer 0 ID Register..Message Buffer 15 ID Register
typedef struct
{
	Strict_32Bit EXT			:18;
	Strict_32Bit STD			:11;
	Strict_32Bit PRIO			:3;
}MM32_FLEXCAN2_ID6Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_ID6Bits B;
}MM32_FLEXCAN2_ID6;

// Message Buffer 0 WORD0 Register..Message Buffer 15 WORD0 Register
typedef struct
{
	Strict_32Bit BYTE3			:8;
	Strict_32Bit BYTE2			:8;
	Strict_32Bit BYTE1			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE0			:8;
}MM32_FLEXCAN2_WORD06Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_WORD06Bits B;
}MM32_FLEXCAN2_WORD06;

// Message Buffer 0 WORD1 Register..Message Buffer 15 WORD1 Register
typedef struct
{
	Strict_32Bit BYTE7			:8;
	Strict_32Bit BYTE6			:8;
	Strict_32Bit BYTE5			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE4			:8;
}MM32_FLEXCAN2_WORD16Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_WORD16Bits B;
}MM32_FLEXCAN2_WORD16;

// Message Buffer 0 CS Register..Message Buffer 15 CS Register
typedef struct
{
	Strict_32Bit TIMESTAMP			:16;
	Strict_32Bit DLC			:4;
	Strict_32Bit RTR			:1;
	Strict_32Bit IDE			:1;
	Strict_32Bit SRR			:1;
	Strict_32Bit _reserved_0			:1;
	Strict_32Bit CODE			:4;
	Strict_32Bit _reserved_1			:4;
}MM32_FLEXCAN2_CS7Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_CS7Bits B;
}MM32_FLEXCAN2_CS7;

// Message Buffer 0 ID Register..Message Buffer 15 ID Register
typedef struct
{
	Strict_32Bit EXT			:18;
	Strict_32Bit STD			:11;
	Strict_32Bit PRIO			:3;
}MM32_FLEXCAN2_ID7Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_ID7Bits B;
}MM32_FLEXCAN2_ID7;

// Message Buffer 0 WORD0 Register..Message Buffer 15 WORD0 Register
typedef struct
{
	Strict_32Bit BYTE3			:8;
	Strict_32Bit BYTE2			:8;
	Strict_32Bit BYTE1			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE0			:8;
}MM32_FLEXCAN2_WORD07Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_WORD07Bits B;
}MM32_FLEXCAN2_WORD07;

// Message Buffer 0 WORD1 Register..Message Buffer 15 WORD1 Register
typedef struct
{
	Strict_32Bit BYTE7			:8;
	Strict_32Bit BYTE6			:8;
	Strict_32Bit BYTE5			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE4			:8;
}MM32_FLEXCAN2_WORD17Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_WORD17Bits B;
}MM32_FLEXCAN2_WORD17;

// Message Buffer 0 CS Register..Message Buffer 15 CS Register
typedef struct
{
	Strict_32Bit TIMESTAMP			:16;
	Strict_32Bit DLC			:4;
	Strict_32Bit RTR			:1;
	Strict_32Bit IDE			:1;
	Strict_32Bit SRR			:1;
	Strict_32Bit _reserved_0			:1;
	Strict_32Bit CODE			:4;
	Strict_32Bit _reserved_1			:4;
}MM32_FLEXCAN2_CS8Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_CS8Bits B;
}MM32_FLEXCAN2_CS8;

// Message Buffer 0 ID Register..Message Buffer 15 ID Register
typedef struct
{
	Strict_32Bit EXT			:18;
	Strict_32Bit STD			:11;
	Strict_32Bit PRIO			:3;
}MM32_FLEXCAN2_ID8Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_ID8Bits B;
}MM32_FLEXCAN2_ID8;

// Message Buffer 0 WORD0 Register..Message Buffer 15 WORD0 Register
typedef struct
{
	Strict_32Bit BYTE3			:8;
	Strict_32Bit BYTE2			:8;
	Strict_32Bit BYTE1			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE0			:8;
}MM32_FLEXCAN2_WORD08Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_WORD08Bits B;
}MM32_FLEXCAN2_WORD08;

// Message Buffer 0 WORD1 Register..Message Buffer 15 WORD1 Register
typedef struct
{
	Strict_32Bit BYTE7			:8;
	Strict_32Bit BYTE6			:8;
	Strict_32Bit BYTE5			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE4			:8;
}MM32_FLEXCAN2_WORD18Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_WORD18Bits B;
}MM32_FLEXCAN2_WORD18;

// Message Buffer 0 CS Register..Message Buffer 15 CS Register
typedef struct
{
	Strict_32Bit TIMESTAMP			:16;
	Strict_32Bit DLC			:4;
	Strict_32Bit RTR			:1;
	Strict_32Bit IDE			:1;
	Strict_32Bit SRR			:1;
	Strict_32Bit _reserved_0			:1;
	Strict_32Bit CODE			:4;
	Strict_32Bit _reserved_1			:4;
}MM32_FLEXCAN2_CS9Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_CS9Bits B;
}MM32_FLEXCAN2_CS9;

