IlleniumDillon/MM32F5277/MM32/MM32_FLEXCAN2Regdef.h
// Message Buffer 0 WORD1 Register..Message Buffer 15 WORD1 Register
typedef struct
{
	Strict_32Bit BYTE7			:8;
	Strict_32Bit BYTE6			:8;
	Strict_32Bit BYTE5			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE4			:8;
}MM32_FLEXCAN2_WORD113Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_WORD113Bits B;
}MM32_FLEXCAN2_WORD113;

// Message Buffer 0 CS Register..Message Buffer 15 CS Register
typedef struct
{
	Strict_32Bit TIMESTAMP			:16;
	Strict_32Bit DLC			:4;
	Strict_32Bit RTR			:1;
	Strict_32Bit IDE			:1;
	Strict_32Bit SRR			:1;
	Strict_32Bit _reserved_0			:1;
	Strict_32Bit CODE			:4;
	Strict_32Bit _reserved_1			:4;
}MM32_FLEXCAN2_CS14Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_CS14Bits B;
}MM32_FLEXCAN2_CS14;

// Message Buffer 0 ID Register..Message Buffer 15 ID Register
typedef struct
{
	Strict_32Bit EXT			:18;
	Strict_32Bit STD			:11;
	Strict_32Bit PRIO			:3;
}MM32_FLEXCAN2_ID14Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_ID14Bits B;
}MM32_FLEXCAN2_ID14;

// Message Buffer 0 WORD0 Register..Message Buffer 15 WORD0 Register
typedef struct
{
	Strict_32Bit BYTE3			:8;
	Strict_32Bit BYTE2			:8;
	Strict_32Bit BYTE1			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE0			:8;
}MM32_FLEXCAN2_WORD014Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_WORD014Bits B;
}MM32_FLEXCAN2_WORD014;

// Message Buffer 0 WORD1 Register..Message Buffer 15 WORD1 Register
typedef struct
{
	Strict_32Bit BYTE7			:8;
	Strict_32Bit BYTE6			:8;
	Strict_32Bit BYTE5			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE4			:8;
}MM32_FLEXCAN2_WORD114Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_WORD114Bits B;
}MM32_FLEXCAN2_WORD114;

// Message Buffer 0 CS Register..Message Buffer 15 CS Register
typedef struct
{
	Strict_32Bit TIMESTAMP			:16;
	Strict_32Bit DLC			:4;
	Strict_32Bit RTR			:1;
	Strict_32Bit IDE			:1;
	Strict_32Bit SRR			:1;
	Strict_32Bit _reserved_0			:1;
	Strict_32Bit CODE			:4;
	Strict_32Bit _reserved_1			:4;
}MM32_FLEXCAN2_CS15Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_CS15Bits B;
}MM32_FLEXCAN2_CS15;

// Message Buffer 0 ID Register..Message Buffer 15 ID Register
typedef struct
{
	Strict_32Bit EXT			:18;
	Strict_32Bit STD			:11;
	Strict_32Bit PRIO			:3;
}MM32_FLEXCAN2_ID15Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_ID15Bits B;
}MM32_FLEXCAN2_ID15;

// Message Buffer 0 WORD0 Register..Message Buffer 15 WORD0 Register
typedef struct
{
	Strict_32Bit BYTE3			:8;
	Strict_32Bit BYTE2			:8;
	Strict_32Bit BYTE1			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE0			:8;
}MM32_FLEXCAN2_WORD015Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_WORD015Bits B;
}MM32_FLEXCAN2_WORD015;

// Message Buffer 0 WORD1 Register..Message Buffer 15 WORD1 Register
typedef struct
{
	Strict_32Bit BYTE7			:8;
	Strict_32Bit BYTE6			:8;
	Strict_32Bit BYTE5			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE4			:8;
}MM32_FLEXCAN2_WORD115Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_WORD115Bits B;
}MM32_FLEXCAN2_WORD115;

//  R0 single mask register
typedef struct
{
	Strict_32Bit MI			:32;
}MM32_FLEXCAN2_RXIMR0Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_RXIMR0Bits B;
}MM32_FLEXCAN2_RXIMR0;

//  R0 single mask register
typedef struct
{
	Strict_32Bit MI			:32;
}MM32_FLEXCAN2_RXIMR1Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_RXIMR1Bits B;
}MM32_FLEXCAN2_RXIMR1;

//  R0 single mask register
typedef struct
{
	Strict_32Bit MI			:32;
}MM32_FLEXCAN2_RXIMR2Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_RXIMR2Bits B;
}MM32_FLEXCAN2_RXIMR2;

//  R0 single mask register
typedef struct
{
	Strict_32Bit MI			:32;
}MM32_FLEXCAN2_RXIMR3Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_RXIMR3Bits B;
}MM32_FLEXCAN2_RXIMR3;

//  R0 single mask register
typedef struct
{
	Strict_32Bit MI			:32;
}MM32_FLEXCAN2_RXIMR4Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_RXIMR4Bits B;
}MM32_FLEXCAN2_RXIMR4;

//  R0 single mask register
typedef struct
{
	Strict_32Bit MI			:32;
}MM32_FLEXCAN2_RXIMR5Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_RXIMR5Bits B;
}MM32_FLEXCAN2_RXIMR5;

//  R0 single mask register
typedef struct
{
	Strict_32Bit MI			:32;
}MM32_FLEXCAN2_RXIMR6Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_RXIMR6Bits B;
}MM32_FLEXCAN2_RXIMR6;

//  R0 single mask register
typedef struct
{
	Strict_32Bit MI			:32;
}MM32_FLEXCAN2_RXIMR7Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_RXIMR7Bits B;
}MM32_FLEXCAN2_RXIMR7;

//  R0 single mask register
typedef struct
{
	Strict_32Bit MI			:32;
}MM32_FLEXCAN2_RXIMR8Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_RXIMR8Bits B;
}MM32_FLEXCAN2_RXIMR8;

//  R0 single mask register
typedef struct
{
	Strict_32Bit MI			:32;
}MM32_FLEXCAN2_RXIMR9Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_RXIMR9Bits B;
}MM32_FLEXCAN2_RXIMR9;

//  R0 single mask register
typedef struct
{
	Strict_32Bit MI			:32;
}MM32_FLEXCAN2_RXIMR10Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_RXIMR10Bits B;
}MM32_FLEXCAN2_RXIMR10;

//  R0 single mask register
typedef struct
{
	Strict_32Bit MI			:32;
}MM32_FLEXCAN2_RXIMR11Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_RXIMR11Bits B;
}MM32_FLEXCAN2_RXIMR11;

//  R0 single mask register
typedef struct
{
	Strict_32Bit MI			:32;
}MM32_FLEXCAN2_RXIMR12Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_RXIMR12Bits B;
}MM32_FLEXCAN2_RXIMR12;

//  R0 single mask register
typedef struct
{
	Strict_32Bit MI			:32;
}MM32_FLEXCAN2_RXIMR13Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_RXIMR13Bits B;
}MM32_FLEXCAN2_RXIMR13;

//  R0 single mask register
typedef struct
{
	Strict_32Bit MI			:32;
}MM32_FLEXCAN2_RXIMR14Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_RXIMR14Bits B;
}MM32_FLEXCAN2_RXIMR14;

//  R0 single mask register
typedef struct
{
	Strict_32Bit MI			:32;
}MM32_FLEXCAN2_RXIMR15Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN2_RXIMR15Bits B;
}MM32_FLEXCAN2_RXIMR15;


#endif
